Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་དེ་བཞིན་གཤེགས་པའི་མཆེ་བའི་བར་ནས་ཕྱུང་བའི་ནས་ཀྱི་ཟན་ཟ་བར་འདོད་དམ།
en: “Ānanda,” said the Blessed One, “do you want to eat the barley meal from the Tathāgata’s own mouth?”

source: བཅོམ་ལྡན་འདས་འཚལ་ལགས་སོ།
en: “Yes, I do, O Blessed One.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མཆེ་བའི་བར་ནས་ནས་ཀྱི་ཟན་ཕྱུང་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བྱིན་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཟའ་བར་བརྩམས་སོ།
en: Then the Blessed One spit out the barley meal from his mouth and gave it to the venerable Ānanda. The venerable Ānanda started to eat it.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་སྔོན་འདི་ལྟ་བུའི་རོ་མྱོང་བར་དྲན་ནམ།
en: The Blessed One said, “Ānanda, have you ever experienced such a taste?”

source: བཙུན་པ་བདག་འཁོར་ལོས་སྒྱུར་བའི་རིགས་སུ་སྐྱེས་ཤིང་འཁོར་ལོས་སྒྱུར་བའི་རིགས་ལས་ཆེན་པོར་གྱུར་ལགས་ན། ད་ལྟར་བཅོམ་ལྡན་འདས་ཀྱི་མཆེ་བའི་བར་ནས་ཕྱུང་བའི་ནས་ཀྱི་བཤོས་འདི་ལྟ་བུའི་རོ་ནི་སྔོན་མྱོང་བར་མི་དྲན་ལགས་སོ།
en: “O Honored One, although I have been born in the family of wheel-turning kings and have grown up in the family of wheel-turning kings, I have never experienced such a taste as that of the barley meal spat from the Blessed One’s mouth.”

source: །ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་ལ་ནི་རོ་བྲོ་བའི་མཆོག་ཅེས་བྱ་བ་རོ་རྣམས་འཕྲོག་པ་ཡོངས་སུ་དག་པ་ཡོད་དེ།
en: “Ānanda, thus the Tathāgata has a clean tongue faculty called possessing the best taste.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་ཁ་ཟས་ཕལ་པ་ལ་ལོངས་སྤྱད་ན་དེ་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་རོ་བརྒྱ་པར་འགྱུར་རོ།
en: If the Tathāgata has even an ordinary meal, for him it becomes of a hundred flavors.”

source: །ཀུན་དགའ་བོ་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ཏེ་མི་སྣང་བའི་ཕྱོགས་སུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ནི་དགྲ་མཐའ་ན་ནས་གསོལ་ལོ་ཞེས་སྒྲ་བསྒྲགས་སོ། །མཐའི་རྒྱལ་པོ་རྣམས་ཀྱིས་ཀྱང་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ཏེ།
en: Then there was a loud shout: “Agnidatta, the brahmin king, is staying in a concealed location, having invited the community of monks headed by the Buddha for three months, and the Blessed One is having barley in Vairambhya!”

source: མི་སྣང་བའི་ཕྱོགས་སུ་འདུག་གོ། །བཅོམ་ལྡན་འདས་ནི་དགྲ་མཐའ་ན་ནས་གསོལ་ལོ་ཞེས་ཐོས་ནས། དེ་རྣམས་ཀྱིས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་ཕོ་ཉ་བཏང་བ་ལས་དེ་རྣམས་ནང་དུ་མ་ཆུད་དེ་སྒོ་ན་སྡོད་དོ།
en: Neighboring kings heard this, too. They sent messengers to Agnidatta, the brahmin king, but the messengers were not able to enter the gate and stayed at the gate.

source: །ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་ཐོས་ནས་འབྲས་སཱ་ལུ་སོག་མའི་སྦུ་བུར་སྨིན་པ་ཤིང་རྟ་ལྔ་བརྒྱ་ཙམ་བཀང་སྟེ་བསྐུར་རོ།
en: When he heard this, Anāthapiṇḍada, the householder, filled five hundred carriages with rice covered with leaves and dispatched them.

source: །དེ་ནས་བདུད་སྡིག་ཅན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་བདག་གིས་ལན་མང་པོ་ཞིག་ཐོབ་ཙམ་པར་བྱས་ན་ལན་འགའ་ཡང་སྐབས་མ་རྙེད་ཀྱིས།
en: Then Māra the Evil One thought, “I have tried to torment the śramaṇa Gautama many times, but I have never had an opportunity for success.

source: འདིར་ཡང་རེ་ཞིག་འདི་ལ་བརྒལ་བར་བྱའོ་སྙམ་དུ་བསམས་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོར་བདག་ཉིད་མངོན་པར་སྤྲུལ་ཏེ། ཤིང་རྟ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ཀྱི་མདུན་དུ་འདུག་ནས་སྨྲས་པ།
en: Here, once and for all, I will defeat him.” Having thought this, he changed into the venerable Ānanda and stood before the five hundred carriages.

source: ཤེས་ལྡན་དག་གར་འདོང་།
en: He asked, “Sirs, where are you going?”

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། འཕགས་པ་ཀུན་དགའ་བོ་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ཏེ་མི་སྣང་བའི་ཕྱོགས་སུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ནི་དགྲ་མཐའ་ན་ནས་གསོལ་ལོ།
en: They said, “O noble one Ānanda, Agnidatta, the brahmin king, is staying in a concealed location, having invited the Blessed One together with the community of disciples for three months, and the Blessed One is having barley in Vairambhya.

source: །དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་ཐོས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དོན་དུ་འབྲས་སཱ་ལུ་སོག་མའི་སྦུ་བུར་སྨིན་པ་ཤིང་རྟ་ལྔ་བརྒྱ་པོ་འདི་བསྐུར་བ་ལགས་སོ།
en: When he heard this, the householder Anāthapiṇḍada then dispatched these five hundred carriages full of rice covered with leaves for the Blessed One.”

source: །དེས་སྨྲས་པ་ཤེས་ལྡན་དག །བཅོམ་ལྡན་འདས་ལ་ནི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་རྣམས་མངོན་པར་དད་དེ།
en: “O sirs,” he replied, “gods, nāgas, and yakṣas have faith in the Blessed One.

source: གལ་ཏེ་ནམ་མཁའ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷུང་བཟེད་བཟེད་ན་དེར་ཡང་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱིས་ལྷའི་བདུད་རྩིས་འགེངས་པར་བྱེད་ན།
en: If the Blessed One raises his bowl in the air, the Thirty-Three Gods fill it with divine nectar.

source: བཅོམ་ལྡན་འདས་ཅིའི་ཕྱིར་ནས་གསོལ། སླར་ལོག་ཤིག །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: Why, then, would the Blessed One eat barley? Go back.”

source: འཕགས་པ་ཀུན་དགའ་བོ་བདག་ཅག་ཆས་ལགས་ན་ད་ཅི་སྟེ་ལྡོག་མཆིའོ།
en: “O noble one Ānanda, we have already departed,” they said. “How can we go back?”

source: །བདུད་ཀྱིས་བསམས་པ། བདག་གིས་འདི་དག་བཟློག་པར་མ་ནུས་ཀྱིས་ཐབས་ཤིག་བཤམ་པར་བྱའོ་ཞེས་དེ་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ནས་ཆར་པ་ཤིང་རྟའི་སྲོག་ཤིང་ཙམ་གྱི་རྒྱུན་དབབ་པར་བརྩམས་ཏེ།
en: Māra thought, “I cannot make them go back. I must devise a plan.” He soared up into the air and caused a heavy rain as if chariot axles were pouring down.

source: དེས་རེ་ཞིག་ཤིང་རྟ་དེ་དག་གི་ལྟེ་བ་མན་ཆད་ནུབ་པ་དེ་ཙམ་གྱི་བར་དུ་ཆར་ཕབ་བོ།
en: It rained until the hubs of the carriages disappeared beneath the water.

source: །དེ་ནས་ཤིང་རྟ་དེ་དག་གི་གླང་རྣམས་བཀྲོལ་ཏེ་དོང་ངོ་།
en: Consequently, the oxen that had been tied to the carriages came untied and ran away.

source: །དེ་ན་བཅོམ་ལྡན་འདས་དགེ་སློང་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བ་དང་ཐབས་ཅིག་ཏུ་དགྲ་མཐའ་ན་ནས་གསོལ་ལོ།
en: Then the Blessed One with the four hundred ninety-eight monks had barley in Vairambhya.

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་གཉིས་ནི་རི་རྩེ་གསུམ་པ་ལ་དབྱར་གནས་པར་ཁས་བླངས་ནས་ལྷའི་བདུད་རྩི་ལ་ལོངས་སྤྱོད་དོ།
en: The venerables Śāriputra and Maudgalyāyana spent the rainy-season retreat on Mount Triśaṅku and enjoyed divine nectar.

source: །དེ་ནས་དེད་དཔོན་དེས་ཟླ་བ་གསུམ་འདས་ནས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་སྐྱེད་མོས་ཚལ་དུ་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: After three months had passed, the caravan leader invited the Blessed One together with the community of disciples to a meal in a park. The Blessed One assented to him by remaining silent.

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་གཉིས་རི་བོ་རྩེ་གསུམ་པ་ལ་དབྱར་གནས་པ་ཡང་འོངས་སོ། །དེ་ནས་དེད་དཔོན་གྱིས་དེ་ཉིད་ཀྱི་མཚན་མོ་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་སྟ་གོན་བྱས་ཏེ་ཞེས་བྱ་བ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་གསོལ་ཟིན་ནས་ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ཏེ་སྨོན་ལམ་གདབ་པར་བརྩམས་པ།
en: The venerables Śāriputra and Maudgalyāyana, having spent the rainy-season retreat on Mount Triśaṅku, went there, too. Thereupon the caravan leader prepared a pure and fine meal during the night . . . knowing the Blessed One had finished his meal and washed his hands and his bowl, he threw himself at the feet of the Blessed One and made an aspiration:

source: དགེ་བའི་རྩ་བ་འདིས་བདག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཅིག །རྟ་ཅང་ཤེས་ནི་བུ་རྒྱལ་ཚབ་ཏུ་གྱུར་ཅིག །རྟ་ལྔ་བརྒྱ་པོ་འདི་དག་ཀྱང་བུ་ལྔ་བརྒྱར་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་བུ་མོ་བཙུན་མོ་རིན་པོ་ཆེར་ལུང་བསྟན་པ་གང་ལགས་པ་དེ་ནི་བདག་གི་བཙུན་མོ་རིན་པོ་ཆེར་གྱུར་ཅིག །བུད་མེད་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བ་གང་ལགས་པ་དེ་ནི་དེའི་འཁོར་དུ་གྱུར་ཅིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེད་དཔོན་དེའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་དེད་དཔོན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: “By this root of merit may I become a wheel-turning king; may my best horse become my crown prince; may these five hundred horses become my five hundred sons; may the girl who was predicted by the Blessed One to become the precious woman become my precious woman; may the four hundred ninety-eight women become her attendants.”

source: །དེད་དཔོན་ཁྱོད་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ།
en: Knowing the caravan leader’s mind with his own mind, the Blessed One said to him, “Caravan leader, you will become a wheel-turning king;

source: །རྟ་ཅང་ཤེས་ནི་ཁྱོད་ཀྱི་བུ་རྒྱལ་ཚབ་ཏུ་འགྱུར་རོ།
en: your best horse will become your crown prince;

source: །རྟ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་བུ་ལྔ་བརྒྱར་འགྱུར་རོ།
en: the five hundred horses will become your five hundred sons;

source: །བུ་མོ་དེ་ནི་བཙུན་མོ་རིན་པོ་ཆེར་འགྱུར་རོ།
en: that girl will become your precious woman;

source: །བུད་མེད་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བ་དེ་དག་ཀྱང་དེའི་འཁོར་དུ་འགྱུར་རོ།
en: those four hundred ninety-eight women will become her attendants.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་བ་གསུམ་པོ་དག་འདས་ནས་ཆོས་གོས་བྱས་པ་དང་ལྡན། ཆོས་གོས་ཟིན་པ་དང་ལྡན་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: After three months had passed and the Blessed One had made and patched his robes, he said to the venerable Ānanda, “Ānanda, go to Agnidatta, the brahmin king.

source: ཀུན་དགའ་བོ་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱི་དྲུང་དུ་སོང་ལ་ནད་མེད་པར་གྱུར་ཅིག་ཅེས་བྱོས་ལ་འདི་སྐད་ཅེས་རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་ཀྱི་ཡུལ་དུ་ཁོ་བོས་ཟླ་བ་གསུམ་གནས་ཟིན་ཏེ་འགྲོས་ཤེས་པར་གྱིས་ཤིག་ཅེས་ཀྱང་སྨྲོས་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས།
en: After saluting him, say, ‘Great King, we have stayed in your country for three months. Farewell, we are going.’ ” “Certainly, O Honored One,” replied the venerable Ānanda to the Blessed One, and he went to the residence of Agnidatta, the brahmin king.

source: རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱི་ཁྱིམ་གང་ན་བ་དེར་སོང་བ་དང་། དེའི་ཚེ་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་བཀྲ་ཤིས་འོང་བ་ལ་སྡོད་ཅིང་འདུག་གོ།
en: At that time Agnidatta, the brahmin king, was waiting for good luck.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྒོ་བའི་སྐྱེས་པ་ལ་སྨྲས་པ། ཀྱེ་ནང་རྗེ་ཚུར་ཁྱོད་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གང་ན་བ་དེར་སོང་ལ་ཕྱིན་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་འདི་སྐད་ཅེས་དགེ་སློང་ཀུན་དགའ་བོ་ལྷ་མཐོང་བར་འཚལ་ནས་སྒོ་ན་སྡོད་ཅིང་མཆིས་སོ་ཞེས་སྨྲོས་ཤིག །འཕགས་པ་བཀའ་བཞིན་འཚལ་ཞེས་སྒོ་བའི་སྐྱེས་པས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའི་ལྟར་མཉན་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The venerable Ānanda said to a doorkeeper, “Sir, go to Agnidatta, the brahmin king. When you arrive, say to him, ‘The monk Ānanda wishes to see Your Majesty and is waiting at the door.’ ”

source: རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Certainly, O noble one,” replied the doorkeeper to the venerable Ānanda, and he went to Agnidatta, the brahmin king.

source: །ལྷ་དགེ་སློང་འཕགས་པ་ཀུན་དགའ་བོ་ལྷའི་ཞལ་མཐོང་བར་འཚལ་ནས་སྒོ་ན་སྡོད་ཅིང་མཆིས་སོ། །དེས་སྨྲས་པ།
en: When he arrived, he said to him, “Your Majesty, the monk Ānanda, the noble one, wishes to see Your Majesty and is waiting at the door.”

source: ཀྱེ་སྐྱེས་བུ་ང་བཀྲ་ཤིས་འོང་བ་སྡོད་ཅིང་འདུག་གིས་དགེ་སློང་ཀུན་དགའ་བོ་ནི་བསོད་ནམས་ཀྱི་མཐུ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ཏེ།
en: “My man, I have been waiting for good luck,” said the king. “The monk Ānanda has great power of merit;

source: དེ་ཉིད་ངའི་བཀྲ་ཤིས་སུ་གྱུར་ཅིག །
en: he himself must be my good luck.

source: དེ་ལ་ནི་བཟང་པོ་ལྔ་ཡོད་དེ།
en: He has five excellent points:

source: མིང་བཟང་བ་དང་། གཟུགས་བཟང་བ་དང་། ཁ་དོག་བཟང་བ་དང་། སྤོབས་པ་བཟང་བ་དང་། སྒྲུབ་པ་བཟང་བ་ཡིན་གྱིས་ནང་དུ་སྤྱོན་ཅིག །ཤེས་ལྡན་ཀུན་དགའ་བོ་ལ་སུ་ཞིག་འགོག །སྒོ་བས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་དེ་བཞིན་དུ་སྨྲས་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནང་དུ་ཞུགས་སོ།
en: an excellent name, excellent looks, excellent caste, excellent eloquence, and excellent perfection. Let him enter. Who would block the honorable Ānanda?” The doorkeeper spoke thus to the venerable Ānanda, and the venerable Ānanda entered.

source: །མཐའི་རྒྱལ་ཕྲན་གྱི་ཕོ་ཉ་དེ་རྣམས་ཀྱང་དེ་ཉིད་དང་ལྷན་ཅིག་ནང་དུ་ཞུགས་སོ།
en: The messengers of the neighboring kings entered with him, too.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་ནད་མེད་པར་གྱུར་ཅིག་ཅེས་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Thereupon the venerable Ānanda saluted Agnidatta, the brahmin king, and sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་ནས་ཁྱོད་ནད་མེད་པར་གྱུར་ཅིག །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱི་ཡུལ་དུ་ངས་ཟླ་བ་གསུམ་དུ་གནས་ཟིན་ཏེ་འགྲོས་ཤེས་པར་གྱིས་ཤིག་ཅེས་ཀྱང་བཀའ་སྩལ་ཏོ།
en: Having sat down to one side, the venerable Ānanda said to Agnidatta, the brahmin king, “Great King, the Blessed One salutes you and says, ‘Great King, we have stayed in your country for three months.

source: །འཕགས་པ་ཀུན་དགའ་བོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ལོ།
en: Farewell, we are going.’ ” “O noble one Ānanda, I bow to the Buddha, the Blessed One.

source: །འཕགས་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་དང་ཇི་ག་ཡུལ་དགྲ་མཐར་དབྱར་བདེ་བར་བཞུགས་སམ།
en: O noble one Ānanda, has the Blessed One spent the rainy-season retreat in Vairambhya in comfort?

source: བསོད་སྙོམས་ཀྱིས་འོ་བརྒྱལ་བར་མ་གྱུར་གྲང་།
en: Was there by chance any trouble with almsfood?”

source: མཐའི་རྒྱལ་ཕྲན་གྱི་ཕོ་ཉ་དེ་དག་གིས་སྨྲས་པ། ལྷ་ཁྱོད་ནི་རྒྱལ་སྲིད་ལ་མི་རྟོག་པ་ལགས་ཏེ།
en: The messengers of the neighboring kings said, “Your Majesty, you are no investigator of your own kingdom!

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ཏེ་མི་སྣང་བའི་ཕྱོགས་སུ་བཞུགས་ནས། བཅོམ་ལྡན་འདས་ནི་ཟླ་བ་གསུམ་དུ་ནས་རུལ་པའི་བཤོས་གསོལ་ལགས་སོ།
en: Thus, having invited the Blessed One together with the community of disciples for three months, you stayed in a concealed location and the Blessed One had meals of rotten barley for three months!”

source: །དེས་སྨྲས་པ། འཕགས་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་བ་གསུམ་དུ་ནས་རུལ་པའི་བཤོས་གསོལ་བ་མད་དམ།
en: “O noble one Ānanda,” said the king, “is it true that the Blessed One had meals of rotten barley for three months?”

source: རྒྱལ་པོ་ཆེན་པོ་མད་ལགས་སོ།
en: “It is true, Great King.”

source: །དེ་བརྒྱལ་ནས་ས་ལ་འགྱེལ་བ་དང་། ཆུ་མང་པོ་ཞིག་གཏོར་ནས་དབུགས་སླར་བྱུང་བ་དང་། བློན་པོ་རྣམས་བཀུག་སྟེ་སྨྲས་པ།
en: The King fainted and fell to the ground. Having had much water poured on him, he recovered his senses.

source: ཤེས་ལྡན་དག་ངས་ཁྱེད་ཅག་རྣམས་ལ་ཉིན་རེ་ཞིང་ལྔ་བརྒྱའི་བཟའ་བ་དང་བཅའ་བ་བསོད་པ་རབ་ཏུ་མང་པོ་སྟ་གོན་གྱིས་ཤིག་པར་མ་བསྒོ་འམ།
en: He called the ministers and asked them, “Sirs, did I not order you, ‘Prepare various kinds of food abundantly for five hundred people every day’?”

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་དེ་ཁོ་ན་སྐད་བཀའ་སྩལ་པ་མཆིས་ཀྱིས་ཆེ་གེ་མོ་ཞིག་ལ་སྩོལ་ཅིག་ཅེས་ནི་ཁྱེད་ཀྱིས་བཀའ་མ་སྩལ་ཏེ།
en: “Your Majesty,” they answered, “although you did order thus, you did not tell us to whom to give the meal.

source: འོན་ཀྱང་ད་དུང་དུ་ཞལ་ཟས་སྟ་གོན་ཁོ་ན་བགྱིད་དོ།
en: However, the meal is still prepared today.”

source: །དེ་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Thereupon Agnidatta, the brahmin king, went to the Blessed One. When he arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད་ཅེས་བྱ་བ་ནས།
en: When he had sat down to one side, the Blessed One, through talk consistent with the Dharma, instructed . . . Agnidatta, the brahmin king.

source: །དེ་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ནོངས་ལགས་སོ། །བདེ་བར་གཤེགས་པ་ནོངས་ལགས་ཏེ། ཇི་ལྟར་ཡང་བུས་པ་ལགས། ཇི་ལྟར་ཡང་རྨོངས་པ་ལགས།
en: Then Agnidatta, the brahmin king, threw himself at the feet of the Blessed One and said, “O Blessed One, what a fault!

source: ཇི་ལྟར་ཡང་མི་གསལ་བ་ལགས།
en: O Sugata, what a fault!

source: ཇི་ལྟར་ཡང་མི་མཁས་པ་ལགས་ཏེ། འདི་ལྟར་བདག་གིས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དགུང་ཟླ་གསུམ་དུ་སྤྱན་དྲངས་ནས་མི་གདའ་བའི་ཕྱོགས་སུ་མཆིས་ལགས་སོ།། །།འདུལ་བ་གཞི། བམ་པོ་སུམ་བཅུ་རྩ་བརྒྱད་པ།
en: I was childish, foolish, dull, and ignorant to stay in a concealed location, having invited the Blessed One together with the community of disciples for three months.

source: བཅོམ་ལྡན་འདས་བདག་གི་ནོངས་པ་དེ་གློ་བར་ཆུད་ཅིང་ནོངས་པར་མཐོང་ལགས་ན་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་ནོངས་པ་ལ་ནོངས་པར་གཟུང་དུ་གསོལ།
en: O Blessed One, I know my fault, I see my fault. Please have compassion and forgive my fault.”

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཉེས་པ་ལ་ཉེས་པར་ཁས་བླངས་ན་བདེན་ཏེ། ཇི་ལྟར་ན་ཡང་བུས་པ་ཡིན། ཇི་ལྟར་ན་ཡང་རྨོངས་པ་ཡིན། ཇི་ལྟར་ན་ཡང་མི་གསལ་བ་ཡིན། ཇི་ལྟར་ན་ཡང་མི་མཁས་པ་ཡིན་ཏེ།
en: “Great King, you have admitted your fault as a fault.

source: གང་ཡང་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ནས་མི་སྣང་བའི་ཕྱོགས་ན་འདུག་གམ།
en: True, you were childish, foolish, dull, and ignorant to stay in a concealed location, having invited the Tathāgata for three months.

source: རྒྱལ་པོ་ཆེན་པོ་གང་གི་ཕྱིར་ཁྱོད་ཀྱིས་ཉེས་པ་ཤེས་ཤིང་མཐོང་ལ་དེ་མཐོང་ནས་འཆགས་པར་བྱེད་ན། ཁྱོད་ཀྱི་དགེ་བའི་ཆོས་རྣམས་ཉམས་པར་མི་འགྱུར་གྱི་འཕེལ་བ་ཁོ་ནར་ཤེས་པར་བྱའོ།
en: Great King, you should know that if you know and see your fault and, having seen it, confess it, your good qualities will not be damaged but only increase.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why, Great King,?

source: གང་ཡང་འགའ་ཞིག་ཉེས་པ་ཤེས་ཤིང་མཐོང་ལ་དེ་མཐོང་ནས་འཆགས་ཤིང་ཕྱིར་སྡོམ་པར་བྱེད་ན། དགེ་བའི་ཆོས་རྣམས་ཉམས་པར་མི་འགྱུར་གྱི་འཕེལ་བ་ཁོ་ནར་ཤེས་པར་བྱའོ།
en: You should know that if anyone knows and sees his fault and, having seen it, confesses it and afterward makes a vow, his good qualities will not be damaged but only increase.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་། ཐབས་ཅིག་ལ་བདག་གིས་ཇི་སྲིད་འཚོའི་བར་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་གྱི་ཡོ་བྱད་རྣམས་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then Agnidatta, the brahmin king, said to the Blessed One, “May the Blessed One together with the community of monks assent to my offer of the requisites for as long as I live: namely, robes, almsfood, bedding and seats, and medicines for the sick.”

source: རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་ནི་ཚེ་ཐུང་ངུའི་དུས་སུ་བྱུང་ཞིང་གདུལ་བའི་དོན་བྱ་བ་ནི་རབ་ཏུ་མང་ལ་མྱ་ངན་ལས་འདའ་བའི་དུས་ལ་ཡང་འབབ་པས་མི་གནང་ངོ་།
en: “Great King,” said the Blessed One, “the Tathāgata was born in a time of short lifespans, and there are many things to do for the benefit of people to be trained. And he has come close to the time for nirvāṇa. Therefore, I do not assent.”

source: །གལ་ཏེ་དེ་ལྟ་ལགས་ན་བཅོམ་ལྡན་འདས་ལོ་བདུན་ནམ། ཟླ་བ་བདུན་ནམ། དགུང་བདུན་ཞིག་གནང་བར་མཛད་དུ་གསོལ།
en: “If so, may the Blessed One assent to my offer of the requisites for seven years, seven months, or seven days.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེར་ཡང་མ་གནང་བ་དང་། བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The Blessed One did not assent to this either.

source: །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Agnidatta, the brahmin king, said to the Blessed One, “May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། ངས་གལ་ཏེ་འདིའི་ཟས་གཅིག་ཀྱང་གསོལ་བར་མ་གནང་ན་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ཁྲག་དྲོན་དུ་སྐྱུགས་ནས་དུས་ལས་འདའ་བར་འགྱུར་བ་གང་ཡིན་པ་དེའི་གནས་ཡོད་དོ་སྙམ་དུ་དགོངས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: Then the Blessed One thought, “It is likely that if I do not assent to having even one meal from him, Agnidatta, the brahmin king, will die, vomiting hot blood.” Thus, the Blessed One assented by remaining silent.

source: །དེ་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་ཆས་ཏེ་རང་གི་གནས་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: Agnidatta, the brahmin king, knowing that the Blessed One had assented by remaining silent, bowed low until his forehead touched the feet of the Blessed One, departed, and went to his residence.

source: ཤེས་ལྡན་དག་གང་གིས་ན་ཞལ་ཟས་འདི་ཐམས་ཅད་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གྱིས་ལོངས་སྤྱོད་པར་འགྱུར་བའི་ཐབས་བཟང་པོ་ཅི་ཡོད། དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: When he arrived, he asked the ministers, “Sirs, is there any good means whereby this whole meal could be consumed by the community of monks headed by the Buddha?”

source: ལྷ་ཞལ་ཟས་འདི་ཐམས་ཅད་དོགས་ལ་བཀྲམ་ལ་དགེ་སློང་རྣམས་ཀྱི་ཞབས་ཀྱིས་བཅགས་ན་དེ་དེ་ལྟར་ན་ཡོངས་སུ་ལོངས་སྤྱད་པར་འགྱུར་ལགས་སོ། །དེས་ཞོ་ཤས་འཚོ་བ་རྣམས་ལ་བསྒོ་བ།
en: “Your Majesty,” they answered, “if this entire meal is scattered on the ground and trampled underfoot by the monks, it will have been fully consumed.”

source: ཤེས་ལྡན་དག་ཁ་ཟས་ཇི་སྙེད་ཡོད་པ་འདི་ཐམས་ཅད་ས་ལ་ཀུན་དུ་ཁྲོམ་ཤིག །དེ་རྣམས་ཀྱིས་ཐམས་ཅད་ཀུན་དུ་བཀྲམ་མོ།
en: They ordered the laborers, “Sirs, scatter on the ground all the food there is.” They scattered on the ground everything there was.

source: །དེ་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་དེ་ཉིད་ཀྱི་མཚན་མོ་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་སྟ་གོན་བྱས་ནས་ཞེས་བྱ་བ་ནས།
en: Thereupon Agnidatta, the brahmin king, prepared various kinds of pure and fine food during the night . . . .

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: The Blessed One sat on the seat prepared for him in front of the community of monks.

source: །ཇི་ཙམ་ན་རྒན་ཞུགས་ཞིག་མི་བཟོད་པ་སྐྱེས་ཏེ་བདག་ཅག་ཟླ་བ་གསུམ་དུ་ནས་རུལ་པ་ཟོས་ནས་ད་ནི་རྒྱལ་པོ་སྡིག་ཅན་འདིའི་འབྱོར་པ་སྟོན་ཏོ་སྙམ་དུ་བསམས་ནས་བཟའ་བ་དང་བཅའ་བ་ས་ལ་བཀྲམ་པའི་སྟེང་དུ་རྡོག་པས་བསྣུན་པ་དང་། བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་འཕགས་པ་རྣམས་ནི་བཟའ་བ་དང་བཅའ་བ་ཁར་གཞུག་པའི་ཟས་ལ་རྐང་པས་རྫི་བར་བྱེད་དོ་ཞེས་སྨོད་པར་བྱེད། ཕྱར་ཁ་གཏོང་བར་བྱེད།
en: At that time a monk who had gone forth in his old age, unable to bear it, thought, “After we have eaten rotten barley for three months, this evil king shows off his riches.” He trampled on the various kinds of foods scattered on the ground. The brahmins and householders criticized, insulted, and disparaged him: “Noble ones stamp with their feet on various kinds of food, which are meant for the mouth.”

source: ཁ་ཟེར་བར་བྱེད་པའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། ཉེས་དམིགས་གང་ཅི་བྱུང་བ་དེ་ནི་དགེ་སློང་དག་བཟའ་བ་དང་བཅའ་བ་ཁར་གཞུག་པའི་ཟས་ལ་རྐང་པས་རེག་པར་བྱེད་པ་ཡིན་ནོ་སྙམ་ནས། དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་དགེ་སློང་རྒན་ཞུགས་ཆེ་གེ་མོ་ཞིག་མི་བཟོད་པ་སྐྱེས་ནས་བཟའ་བ་དང་བཅའ་བ་ཁར་གཞུག་པའི་ཟས་ས་ལ་བཀྲམ་པའི་སྟེང་དུ་རྡོག་པས་བསྣུན་པས་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་སྨོད་པར་བྱེད། ཕྱར་ཁ་གཏོང་བར་བྱེད།
en: When the monks reported this matter to the Blessed One, the Blessed One thought, “The fault that occurred in this case was that the monks touched with their feet various kinds of food, which are meant for the mouth.” He said to the monks, “Monks, since the monk So-and-so, who had gone forth in his old age, unable to bear what had happened, trampled on the various kinds of food scattered on the ground, which were meant for the mouth, the brahmins and householders criticized, insulted, and disparaged him.

source: ཁ་ཟེར་བར་བྱེད་དོ། །དེ་ལྟ་བས་ན་དགེ་སློང་གིས་བཟའ་བ་དང་བཅའ་བ་ཁར་གཞུག་པའི་ཟས་ལ་རྐང་པས་བཅག་པར་མི་བྱའོ།
en: Therefore, a monk should not trample with his feet various kinds of food, which are meant for the mouth.

source: །བཅགས་ན་འགལ་ཚབས་ཅན་དུ་འགྱུར་རོ།
en: If he does so, he becomes guilty of an offense.”

source: །དེ་ནས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་གྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་སྟོབས་ཤིང་ཚིམ་པར་བྱེད་དེ་ཞེས་བྱ་བ་ནས། ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Thereupon Agnidatta, the brahmin king, knew that the community of monks headed by the Buddha had sat down in comfort, and with his own hands he served and satisfied them with a pure and fine meal, . . . knowing the Blessed One had . . . washed his hands and his bowl, he took a low seat and sat before the Blessed One in order to hear the Dharma.
